//0. Вывести квадрат числа 
//Console.WriteLine("Введите число");
//double a = Convert.ToDouble (Console.ReadLine());
// Math.Pow(a, 2) Возвращает указанное число, возведенное в указанную степень.
//Console.WriteLine($"Квдарат числа {a} равно {Math.Pow(a, 2)}"); 

double a = 5;
double squren(double result)
{
    double squre = result * result;
    return squre;
    
}
Console.WriteLine($"Квадрат числа {a} = {squren(a)}");






