//Задача 2
//Задать положительное вещественное число m. Cоставить целое число n из цифр

//десятков и сотых m
//единиц и сотых m
//сотен и десятых m

double m = 55.9954512365841236578;
Console.WriteLine(m);
